Repository: giellalt/corpus-sme
Catalog: prestable/tmx/nob2sme/admin/others/Samisk_som_forstesprak_nordsamisk.doc.tmx
Source language: sme
Languages: nob

source: geavahit árbevirolaš muitalusaid iežas barggus
nob: bruke tradisjonelle fortellinger i eget arbeid

source: čilget ja čájehit ovdamearkkaiguin movt sániid sáhttá suorggidit
nob: forklare og vise med eksempler hvordan ord kan avledes

source: válddahit giela ja giellageavaheami , sátneluohkáid ja daid doaimma
nob: beskrive språk og språkbruk , ordklasser og deres funksjon

source: geavahit deaŧaleamos riektačállinnjuolggadusaid
nob: bruke de viktigste rettskrivningsreglene

source: ságastallat máŋggagielalašvuođa birra
nob: samtale om hva flerspråklighet innebærer

source: Gelbbolašvuođamihttomearit 7. jahkeceahki maŋŋel
nob: Etter 7. årstrinn

source: doaibmat iešguđetlágan giellarollain rollaneavttašeami ja drámá , lohkama , jearahallamiid ja ovdanbuktimiid bokte
nob: opptre i ulike språkroller gjennom rollespill og drama , opplesing , intervju og presentasjoner lede et møte

source: guldalit earáid , albmanahttit ja ákkastallat oaiviliiddis ja árvvusatnit earáid oaiviliid
nob: lytte til andre , uttrykke og grunngi egne standpunkter og vise respekt for andres

source: ovdandivvut fágaáššiid njálmmálaččat veahkkeneavvuiguin dahje haga
nob: presentere et fagstoff muntlig med eller uten hjelpemidler

source: digaštallat movt giella sáhttá albmanahttit ja dahkat miellaguottuid ovttaskas olbmui ja olmmošjoavkkuide
nob: diskutere hvordan språk kan uttrykke og skape holdninger til enkeltindivider og grupper av mennesker

source: geavahit dihtomielalaččat sámegielsániid ja dajaldagaid
nob: bruke samiske ord og uttrykk bevisst

source: lohkat guhkit čáppagirjjálašvuođateavsttaid , mánáid- ja nuoraidgirjjálašvuođa- ja áššeprosateavsttaid , ja albmanahttit ipmárdusa ja lohkanmuosáhusaid
nob: lese lengre skjønnlitterære tekster , barne-og ungdomslitteratur og sakprosatekster og uttrykke forståelse og leseopplevelser

source: lohkat eará eamiálbmogiid árbevirolaš muitalusaid ja buohtastahttit daid sámi máidnasiiguin ja muitalusaiguin
nob: lese andre urfolks tradisjonelle fortellinger og sammenligne disse med samiske eventyr og fortellinger

source: geavahit iešguđetlágan lohkanstrategiijaid lohkat iešguđetlágan teavsttaid iešguđet leahtuin
nob: bruke varierte lesestrategier for å lese ulike typer tekst i ulikt tempo

source: ovdánahttit iežas čállosa jurdagis gárvves buvttan , ja árvvoštallat teavstta ovdáneami responssa vuođul
nob: utvikle egen tekst fra ide til produkt , og vurdere tekstens utvikling på grunnlag av respons

source: ovdandivvut iežas čáppagirjjálašvuođa ja fágagirjjiid lohkanvásáhusaid ja geavahit dáid vásáhusaid vuođđun iežas čállinbargguide
nob: presentere egne leseerfaringer fra skjønnlitteratur og fagbøker og bruke disse erfaringene som grunnlag for eget skriftlig arbeid

source: árvvoštallat iežas ja earáid teavsttaid
nob: vurdere egne og andres tekster

source: geavahit heivvolaš gálduid ja diehtogirjjiid barggadettiin teavsttaiguin
nob: bruke kilder og oppslagsverk i arbeid med tekster

source: čállit oktilit persovnnalaš ja doaibmi giehtačállagiin
nob: skrive sammenhengende med personlig og funksjonell håndskrift

source: geavahit digitála reaidduid čállinproseassas ja interaktiivateavsttaid buvttadeamis
nob: bruke digitale skriveverktøy i skriveprosesser og i produksjon av interaktive tekster

source: geavahit ulbmillaččat girjerádjosa , sámegiel diehtogirjjiid , sámegiel mediaid ja digitála diehtogálduid
nob: benytte biblioteket , samiske oppslagsverk , samiske medier og digitale informasjonskanaler på en målrettet måte

source: geavahit dálke- ja siivusániid ja - doahpagiid , ja muitalit mearkabeivviid ja dálkemearkkaid birra
nob: bruke ord og begreper for vær og føre , og fortelle om merkedager og værtegn

source: čohkket dieđuid lagasbirrasis diiddaid ja sátnevádjasiid birra ja movt daid geavahit beaivválaš eallimis
nob: innhente informasjon i sitt eget lokalmiljø om diiddat / dijda og ordtak og om hvordan de brukes i hverdagen

source: geavahit árbevirolaš bargguide čadnon sániid ja doahpagiid ja ságastallat mii birgejupmi lea
nob: bruke ord og begreper knyttet til tradisjonelle arbeidsoppgaver og samtale om hva birgejupmi / bierggim / bïerkenidh er

source: selvehit movt ráhkadit goallossániid ja suorggádusaid ja movt heivehit loatnasániid
nob: gjøre rede for hvordan ordavledninger og sammensatte ord blir laget og hvordan tilpasse lånord

source: čájehit movt giella rievddada dilálašvuođa , áiggi ja báikki mielde
nob: påvise hvordan språket forandrer seg i forhold til situasjon , tid og sted

source: čájehit goal lea váldocealkka ja oalgecealkka , ja geavahit iešguđet cealkkaráhkadusaid
nob: skille mellom helsetning og leddsetning , og bruke ulike setningskonstruksjoner

source: struktureret teavstta áigeortnetvuoru ja fáttá mielde ja ráhkadit oktavuođa gaskkal cealkagiid ja teakstaosiid
nob: strukturere tekst etter tidsrekkefølge og tema og skape sammenheng mellom setninger og avsnitt

source: selvehit movt eanetlogugielat leat váikkuhan ja ain váikkuhit sámegillii
nob: gjøre rede for hvordan majoritetsspråkene har påvirket og fortsatt påvirker det samiske språket

source: válddahit earenoamášvuođaid iežas suopmanis čállingiela ektui
nob: beskrive egenarter i egen dialekt i forhold til skriftspråket

source: muitalit giellaguovlluid birra Sámis
nob: fortelle om språkområdene i Sápmi / Sábme / Saepmie

source: Gelbbolašvuođamihttomearit 10. jahkeceahki maŋŋel
nob: Etter 10. årstrinn

source: muitalit gulahallanvugiid birra ja movt gielalaš ja kultuvrralaš girjáivuohta váikkuha gulahallamii
nob: fortelle om ulike kommunikasjonsformer og hvordan språklige og kulturelle variasjoner påvirker kommunikasjonen

source: digaštallat gielladikšuma
nob: diskutere språkrøkt

source: jođihit ja refereret čoahkkimiin ja digaštallamiin , albmanahttit oaiviliiddis ja árvvoštallat mii lea áššálaš ákkasteapmi
nob: lede og referere fra møter og diskusjoner , uttrykke egne meninger og vurdere hva som er saklig argumentasjon

source: ságaskuššat ja čilget máŋggagielalašvuođa ja máŋggakultuvrralaš gullevašvuođa
nob: drøfte og forklare flerspråklighet og flerkulturell tilhørighet

source: čađahit eaŋkalis logaldallamiid , ovdanbuktimiid , muitaleaddji lohkamiid , rollaneavttašemiid ja dramatiserema , heivehuvvon iešguđetlágan vuostáiváldiide
nob: gjennomføre enkle foredrag , presentasjoner , tolkende opplesing , rollespill og dramatisering , tilpasset ulike mottakere

source: árvvoštallat iežas ja earáid njálmmálaš ovdanbuktimiid
nob: vurdere egne og andres muntlige fremføringer

source: muitalit iežas mielamiel girjjiid ja girječálliid birra ja ákkastallat girjeválljemiiddis
nob: fortelle om bøker og forfattere ut fra egen interesse og argumentere for sitt bokvalg

source: lohkat ja buohtastahttit sámi ja eará eamiálbmogiid girjjálašvuođa
nob: lese og sammenligne samisk og andre urfolks litteratur

source: árvvoštallat máidnosiid ja guoimmuhanmediaid váikkuhangaskaomiid ja reflekteret movt dat váikkuhit
nob: vurdere virkemidler i reklame og underholdingsmedier og reflektere over hvilken påvirkning de har

source: gaskkustit iežas lohkanvásáhusaid ja lohkanmuosáhusaid dulkoma ja reflekterema vuođul
nob: formidle egne leseerfaringer og leseopplevelser basert på tolkning og refleksjon

source: dovdát iešguđetlágan gielalaš váikkuhangaskaomiid ja geavahit daid iežas teavsttain
nob: gjenkjenne ulike språklige virkemidler og bruke dem i egne tekster

source: plánet ja čađahit čállinprošeavtta jurdaga rájes gárvves buvttan ja árvvoštallat iežas teavstta ja iežas čállinovdáneami giella- ja teakstamáhtu vuođul
nob: planlegge og fullføre et skriftlig prosjekt fra ide til ferdig produkt og vurdere egen tekst og egen skriveutvikling ved hjelp av kunnskap om språk og tekst

source: ovdanbuktit dárkilit ja geavahit girjás ja máŋggabealat sátneriggodaga iešguđetlágan teavsttain
nob: uttrykke seg presist og med et variert og nyansert ordforråd i ulike typer tekster

source: geavahit teakstagieđahallanreaidduid iežas bargguid vurket ja systematiseret
nob: bruke tekstbehandlingsverktøy til arkivering og systematisering av eget arbeid

source: geavahit teavsttaid maid lea viežžan girjerádjosis , Interneahtas ja mediain kritihkalaččat , ságaskuššat teavsttaid ja čujuhit geavahuvvon gálduide
nob: bruke tekster hentet fra bibliotek , Internett og massemedier på en kritisk måte , drøfte tekstene og referere til benyttede kilder

source: lohkat ja ieš čállit teavsttaid iešguđetlágan šáŋrain , sihke áššeprosa ja čáppagirjjálašvuođa teavsttaid
nob: lese og skrive tekster i ulike sjangere , både skjønnlitterære- og sakspreget

source: selvehit sámi girjjálašvuođa váldoáigodagaid ja muitalit sámi girječálliid ja sámi girjjálašvuođa klassihkkáriid birra
nob: gjøre rede for hovedperiodene i samisk litteraturhistorie og fortelle om forfattere og klassikere i samisk litteratur

source: ovdandivvut iežas válljen čiekŋudanfáttá bohtosiid
nob: presentere resultat av fordypning i et selvvalgt emne

source: buohtastahttit árbevirolaš sámegielteavsttaid ođđaáigásaš teavsttaiguin
nob: sammenligne tradisjonelle samiske tekster med moderne tekster

source: geavahit sániid , doahpagiid ja dadjanvugiid mat gusket lundui
nob: bruke ord , begrep og uttrykksmåter som har tilknytning til natur

source: buohtastahttit sámi ja dáru sátnevádjasiid
nob: sammenligne samiske ordtak med norske ordtak

source: hálddašit riektačállima ja ortografiija ja dábálaš teakstalađastanvugiid
nob: beherske rettskriving og ortografi og vanlige tekstdelingsmetoder

source: čilget sátneluohkáid , sojahanoahpa , suorggideami ja cealkkaoahpa vuođđoáššiid , barggadettiin gielain ja teavsttaiguin
nob: forklare ordklasser , bøyningslære , ordavledninger og grunnprinsippene i setningslæren i arbeid med språk og tekster

source: ságaskuššat movt áimmahuššat gielladikšuma ja giellaovdánahttima
nob: drøfte hvordan språkrøkt og språkutvikling kan ivaretas

source: identifiseret sámegielaid ja muitalit ovttaláganvuođaid ja erohusaid birra dain ja muitalit suoma-ugralaš giellajoavkku birra
nob: identifisere de samiske språkene og fortelle om likheter og forskjeller mellom dem og fortelle om den finskugriske språkfamilie

source: selvehit rivttiid mat gusket sámegillii
nob: gjøre rede for rettigheter i forbindelse med samisk språk

source: Gelbbolašvuođamihttomearit Jo 1 - studerenráhkkanahtti oahppoprográmma maŋŋel
nob: Etter Vg 1 - studieforberedende utdanningsprogram

source: Gelbbolašvuođamihttomearit Jo 2 - fidnofágalaš oahppoprográmma maŋŋel
nob: Etter Vg 2 – yrkesfaglige utdanningsprogram

source: hálddašit iešguđetlágan njálmmálaš rollaid joavkoságastallamiin , logaldallamiin , dramatiseremiin , ovdandivvumiiguin ja čájálmasain sihke oassálastin ja guldaleaddjin
nob: mestre ulike muntlige roller i gruppesamtaler , foredrag , dramatiseringer , presentasjoner og fremføringer som aktør og tilhører

source: čilget mii gulahallamii váikkuha , makkár dagaldagat sáhttet ovddidit ja hehttet gulahallama
nob: forklare hva som påvirker kommunikasjon , både faktorer som fremmer og hemmer kommunikasjon

source: geavahit prográmmafágaid fágamáhtu fágalaš gulahallamis
nob: bruke fagkunnskap fra programfag i faglig kommunikasjon

source: dulkot beaivválaš áššiid dárogielas sámegillii
nob: tolke fra norsk til samisk fra hverdagslige situasjoner

source: digaštallat eatnigiela , guovttegielalašvuođa ja doaibmi guovttegielalašvuođa doahpagiid iežas gielladili ja vásáhusaid vuođul ja árvvoštallat iežas giellamáhtu guđege gielas ja iešguđetlágan giellaoktavuođain
nob: diskutere begrepene morsmål , tospråklighet og funksjonell tospråklighet på grunnlag av egen språksituasjon og egne erfaringer og vurdere egne språkferdigheter i flere språk og i forskjellige språksammenhenger

source: digaštallat ja buohtastahttit gielalaš ja estehtalaš váikkuhangaskaomiid girjjálašvuođas , TV-ráidduin ja máidnasiin
nob: diskutere språklige og estetiske virkemidler i litteratur , TV-serier og eventyr og sammenligne med hverandre

source: lohkat teavsttaid ja ságastallat earáiguin dan birra maid lea lohkan
nob: lese tekster og samtale med andre om hva man har lest

source: máhttit riektačállinnjuolggadusaid barggadettiin iežas teavsttaiguin
nob: beherske rettskrivningsreglene i arbeid med egne tekster

source: hálddašit iešguđetlágan čállirollaid skuvlla almmolašvuođas ja servodat- ja bargoeallimis
nob: mestre ulike skriverroller i skolens offenlighet og i samfunns- og arbeidsliv

source: jorgalit iežas čállin teavsttaid dárogielas sámegillii
nob: oversette egenproduserte tekster fra norsk til samisk

source: čállit hutkkálaš teavsttaid iešguđetlágan šáŋrain
nob: skrive kreative tekster i ulike sjangere

source: geavahit digitála reaidduid teavsttaid systematiseret ja vurket ja iežas bargguid ovdandivvut ja almmuhit
nob: bruke digitale verktøy i systematisering og arkivering av tekster og presentasjon og publisering av eget arbeid

source: geavahit girjás , máŋggabealat gielalaš váikkuhangaskaomiid iežas čállimis , sihke čáppagirjjálašvuođas ja áššeprosas*
nob: bruke et bredt spekter av språklige virkemidler i egen skriving , både i skjønnlitteratur og sakprosa*

source: lohkat ja analyseret vissis meari iešguđetlágan teavsttaid , sihke čáppagirjjálašvuođa ja áššeprosa šáŋraid , mat gullet maŋŋá 1995 áigodahkii*
nob: lese og analysere et representativt utvalg av tekster , skjønnlitteratur og sakprosa , knyttet til perioden etter 1995 *

source: selvehit movt muitalusat , sátnevádjasat , diiddat ja nárrideapmi geavahuvvojit mánáidbajásgeassimis
nob: gjøre rede for hvordan fortellinger , ordspråk , diiddat og nárrideapmi brukes i barneoppdragelsen

source: selvehit máidnasiid variánttaid ja buktit ovdamearkkaid movt kulturlonohallan vuhtto máidnasiin
nob: gjøre rede for ulike eventyrvarianter og eksempler på spor av kulturutveksling i eventyrene

source: čilget movt ođđa sánit ja tearpmat sámegielas ráhkaduvvojit ja loatnasániid geavaheami ja heivehallama
nob: forklare hvordan nye ord og termer i samisk utvikles og om bruk og tilpasning av lånord

source: geavahit sániid ja dajaldagaid mat čatnasit árbevirolaš ja ođđaáigásaš bargoeallimii ja evttohit ja árvvoštallat ođđa tearpmaid
nob: bruke ord og uttrykk knyttet til tradisjonelt og moderne yrkesliv og foreslå og vurdere nye termer

source: čilget sámegiela grammatihkalaš iešvuođaid ja buohtastahttit eará gielaiguin ja čilget movt dát váikkuha jorgalanbargui*
nob: forklare grammatiske særtrekk ved samisk språk og sammenligne med andre språk og forklare hvilke konsekvenser dette får i oversettingsarbeid*

source: identifiseret variašuvnnaid sámegielain*
nob: identifisere variasjoner innenfor de samiske språkene*

source: geavahit sániid ja dajaldagaid mat gusket árbevirolaš ja ođđaáigásaš bargoeallimii , árvalit ja árvvoštallat ođđa tearpmaid
nob: bruke ord og uttrykk knyttet til tradisjonelt og moderne yrkesliv , foreslå og vurdere nye termer

source: Gelbbolašvuođamihttomearit Jo 2 - studerenráhkkanahtti oahppoprográmma maŋŋel
nob: Etter Vg 2 - studieforberedende utdanningsprogram

source: geavahit iežas prográmmafágaid fágamáhtu logaldallamiin ja digaštallamiin skuvlla , servodaga ja bargoeallima birra
nob: bruke fagkunnskap fra egne programfag i foredrag og diskusjoner om skole , samfunn og arbeidsliv

source: árvvoštallat ja buktit oaiviliid iežas ja earáid njálmmálaš ovdandivvumiidda
nob: vurdere og gi tilbakemelding på egne og andres muntlige presentasjoner

source: dulkot áššiid mat gusket skuvlii dárogielas sámegillii
nob: tolke saker som angår skolen fra norsk til samisk

source: analyseret ja selvehit gulahallanvugiid ja gulahallanstrategiijaid sámi servodagain ovdal ja dál
nob: analysere og gjøre rede for kommunikasjonsmåter og kommunikasjonsstrategier i samiske samfunn før og nå

source: buohtastahttit sámi ja eará eamiálbmogiid teavsttaid ja árvvoštallat daid mearkkašumi kultur-- ja identitehtahuksejeaddjin
nob: sammenligne samiske og andre urfolks tekster og vurdere tekstenes betydning for kultur- og identitetsutvikling

source: ságastallat sámi girjjálašvuođahistorjjá váldoáigodagaid birra ja buohtastahttit davviriikkaid girjjálašvuođa historjjáin
nob: samtale om hovedperiodene i samisk litteraturhistorie og sammenligne med nordisk litteraturhistorie

source: lohkat álkis teavsttaid čállon eará sámegielaide
nob: lese enkle tekster på de andre samiske språkene

source: lohkat teavsttaid mat leat čállon dološ čállinvugiide ja buohtastahttit dálá čállinvugiin
nob: lese tekster skrevet i eldre ortografi og sammenligne med dagens ortografi

source: analyseret teavsttaid iešguđet šáŋrain vai sáhttá oaivvildit maidege dain gažaldagain mat teavsttain bohtet ovdan ja árvvuin maid dat ovddastit
nob: analysere tekster i ulike sjangere for å kunne ta stilling til spørsmål tekstene tar opp og verdier de representerer

source: teavstta buvttadeamis válljet heivvolaš šáŋra , váikkuhangaskaomiid ja giellageavaheami
nob: velge passende sjanger , virkemidler og språkbruk ved produksjon av tekst

source: válddahit ja árvvoštallat iežas lohkan- ja čállinstrategiijaid
nob: beskrive og vurdere egne lese-og skrivestrategier

source: lohkat ja analyseret vissis meari iešguđetlágan teavsttaid , sihke čáppagirjjálašvuođa ja áššeprosa šáŋraid , mat gullet ovdal 1965 áigodahkii
nob: lese og analysere et representativt utvalg av litteratur og tekster , skjønnlitteratur og sakprosa , knyttet til perioden før 1965

source: selvehit juoiganárbevieru ja luođi saji , árvvu ja dili ovdal ja dál
nob: gjøre rede for joiketradisjonen og joikens status , verdi og situasjon før og nå

source: buohtastahttit sámi ja dáru lávlla- ja sálbmaárbevieruid
nob: sammenligne samisk og norsk sang- og salmetradisjon

source: selvehit sámi giellahistorjjá
nob: gjøre rede for samisk språkhistorie

source: digaštallat movt giela árvu servodagas lea váikkuhan sámiid giellamáhttui , guovttegielalašvuhtii ja iešdovdui
nob: diskutere hvordan språkets status i samfunnet har påvirket samenes språkkunnskaper , tospråklighet og selvfølelse

source: árvvoštallat Sámelága giellanjuolggadusaid ja Sámedikki ásaheami gielladili ja guovttegielalašvuođa ektui
nob: vurdere Samelovens språkregler og Sametingets opprettelse i forhold til språksituasjon og tospråklighet

source: ságaskuššat man láhkái skuvla , servodat ja bargoeallin sáhtáše doarjut guovttegielalašvuođa
nob: drøfte hvordan skole , samfunn og arbeidsliv kan støtte opp om tospråklighet

source: geavahit cealkkaanalysa ja fágatearpmaid gielaid válddaheamis
nob: bruke setningsanalyse og fagtermer i beskrivelse av språk

source: Gelbbolašvuođamihttomearit Jo 3 - studerenráhkkanahtti oahppoprográmma maŋŋel
nob: Etter Vg 3 - studieforberedende utdanningsprogram

source: dulkot ja geavahit dulkongelbbolašvuođa praktihkalaš dulkondilálašvuođain
nob: tolke og bruke kunnskap om tolking i praktiske tolkesituasjoner

source: ságastallat iešguđet kultuvrraid gulahallanvugiid birra
nob: samtale om kommunikasjonsmåter i ulike kulturer

source: buohtastahttit ja árvvoštallat sámi ja eará eamiálbmogiid fiktiivvalaš teavsttaid ja áššeteavsttaid kultuvrralaš konteavsttas
nob: sammenligne og vurdere samiske og andre urfolks fiktive tekster og sakstekster i en kulturell kontekst

source: čađahit ja ovdandivvut iežas válljen čiekŋudanbarggu mas fáddá lea giella , girjjálašvuohta dahje eará sámi fáddá
nob: gjennomføre og presentere en selvvalgt fordypningsoppgave med språklig , litterært eller annet samisk emne

source: guorahallat teavsttaid ideologiija ja árvvoštallat gálduid ja mediaid
nob: undersøke ideologier i tekster og vurdere kilder og media

source: jorgalit ja heivehit earáid čállin teavsttaid dárogielas sámegillii
nob: oversette og tilpasse andres tekster fra norsk til samisk

source: čállit fágateavsttaid dábálaš fágačállinnjuolggadusaid mielde
nob: skrive fagtekster etter vanlige normer for fagskriving

source: čállit čielgasit disponerejuvvon teavsttaid main lea čielga fokus ja áššálaš ákkasteapmi
nob: skrive klart disponerte tekster med tydelig fokus og saklig argumentasjon

source: lohkat ja analyseret vissis meari iešguđetlágan teavsttaid , sihke čáppagirjjálašvuođa ja áššeprosa šáŋraid , mat gullet 1965-1995 áigodahkii ja digaštallat movt áigodaga servodatlaš ja kultuvrralaš dilit oidnojit teavsttain
nob: lese og analysere et representativt utvalg av litteratur og tekster , skjønnlitteratur og sakprosa , knyttet til perioden 1965 - 1995 og diskutere hvordan periodens samfunnsmessige og kulturelle trekk gjenspeiles i tekstene

source: selvehit sámi máinnasteami
nob: gjøre rede for samisk fortellertradisjon

source: muitalit muitalusaid geavahettiin sámi máinnasteami elemeanttaid
nob: fortelle eventyr ved å bruke elementer fra samisk fortellertradisjon

source: buohtastahttit sámi máidnasiid eará eamiálbmogiid ja eará kultuvrraid máidnasiiguin
nob: sammenligne samiske eventyr med andre urfolks eventyr og eventyr fra andre kulturer

source: guldalit ja lohkat teavsttaid čállon eará sámegielaide ja ságastallat ovttaláganvuođaid ja erohusaid birra
nob: lytte og lese tekster fra de andre samiske språkene og samtale om likheter og ulikheter

source: buohtastahttit sámi giellahistorjjá váldolinjjáid davviriikkalaš gielaid historjjáin
nob: sammenligne hovedlinjene i samisk språkhistorie med de nordiske språkenes historie

source: árvvoštallat sámegielaid dili servodagas ja buohtastahttit eará eamiálbmogiid gielladiliin
nob: vurdere de samiske språkenes stilling i samfunnet og sammenligne med språksituasjonen til andre urfolk

source: digaštallat sámi giellapolitihka ja kulturovdánahttima beliid
nob: diskutere sider ved samisk språkpolitikk og kulturutvikling

source: selvehit njálmmálaš ja čálalaš giela gaskavuođa
nob: gjøre rede for forholdet mellom muntlig og skriftlig språk

source: Gelbbolašvuođamihttomearit lasáhusa oppalaš studerengelbbolašvuhtii - fidnofágalaš oahppoprográmma maŋŋel
nob: Etter påbygging til generell studiekompetanse – yrkesfaglige utdanningsprogram

source: ságastallat eará kultuvrraid gulahallanvugiid birra
nob: samtale om kommunikasjonsmåter i ulike kulturer

source: geavahit girjás , máŋggabealat gielalaš váikkuhangaskaomiid iežas čállimis , sihke čáppagirjjálašvuođas ja áššeprosas
nob: bruke et bredt spekter av språklige virkemidler i egen skriving , både i skjønnlitteratur og sakprosa

source: lohkat ja analyseret vissis meari iešguđetlágan teavsttaid , sihke čáppagirjjálašvuođa ja áššeprosa šáŋraid , mat gullet áigodahkii 1965-1995 ja , digaštallat movt áigodaga servodatlaš ja kultuvrralaš dilit oidnojit teavsttain
nob: lese og analysere et representativt utvalg av tekster , skjønnlitteratur og sakprosa , knyttet til perioden 1965 - 1995 og diskutere hvordan periodens samfunnsmessige og kulturelle trekk gjenspeiles i tekstene

source: lohkat ja analyseret vissis meari iešguđetlágan teavsttaid , sihke čáppagirjjálašvuođa ja áššeprosa šáŋraid , mat gullet áigodahkii maŋŋil jagi 1995
nob: lese og analysere et representativt utvalg av tekster , skjønnlitteratur og sakprosa , knyttet til perioden etter 1995

source: selvehit juoiganárbevieru ja luođi árvvu ja dili dálá servodagas
nob: gjøre rede for joiketradisjonen og joikens status og situasjon i dagens samfunn

source: buohtastahttit sámi ja eará eamiálbmogiid máidnasiid ja eará kultuvrraid máidnasiid
nob: sammenligne samiske eventyr med andre urfolks eventyr og eventyr fra andre kulturer

source: čilget sámegiela grammatihkalaš iešvuođaid ja buohtastahttit eará gielaiguin ja čilget movt dát váikkuha jorgalanbargui
nob: forklare grammatiske særtrekk ved samisk språk og sammenligne med andre språk og forklare hvilke konsekvenser dette får i oversettingsarbeid

source: identifiseret variašuvnnaid sámegielain
nob: identifisere variasjoner innenfor de samiske språkene
